In [5]:
'''
INTRODUCTION TO PANDAS üêº
Python library for data analysis and manipulation

Two main data structures
1D - Series (list)
2D - DataFrame (matrix)

Why ?
- Support for CSV, Excel, SQL, JSON etc
- Powerful data aggregation and grouping
- Easy handling of missing
- Convenient for filtering, joining, and reshaping
'''

'\nINTRODUCTION TO PANDAS üêº\nPython library for data analysis and manipulation\n\nTwo main data structures\n1D - Series (list)\n2D - DataFrame (matrix)\n\nWhy ?\n- Support for CSV, Excel, SQL, JSON etc\n- Powerful data aggregation and grouping\n- Easy handling of missing\n- Convenient for filtering, joining, and reshaping\n'

In [6]:
import numpy as np
import pandas as pd

In [18]:
friends = {
    "name": ["Nitin", "Shyam", "Pavan"],
    "city": ["Bangalore", "Delhi", "Vishakha"],
    "marks": [98, 99, 100]
}

In [19]:
# Create dataframe
df = pd.DataFrame(friends)

In [20]:
df

    name       city  marks
0  Nitin  Bangalore     98
1  Shyam      Delhi     99
2  Pavan   Vishakha    100

In [21]:
# Saving dataframe to files
df.to_csv('friends.csv')

In [22]:
# Saving dataframe to files without index
df.to_csv('friends.csv', index=False)

In [23]:
# top of dataframe
df.head(2)

    name       city  marks
0  Nitin  Bangalore     98
1  Shyam      Delhi     99

In [24]:
# bottom of dataframe
df.tail(2)

    name      city  marks
1  Shyam     Delhi     99
2  Pavan  Vishakha    100

In [25]:
df

    name       city  marks
0  Nitin  Bangalore     98
1  Shyam      Delhi     99
2  Pavan   Vishakha    100

In [27]:
df.describe()

       marks
count    3.0
mean    99.0
std      1.0
min     98.0
25%     98.5
50%     99.0
75%     99.5
max    100.0

In [28]:
friendsRead = pd.read_csv('friends-read.csv')

In [29]:
friendsRead

     name       city  marks
0   Nitin  Bangalore     98
1   Shyam      Delhi     99
2   Pavan   Vishakha    100
3  Anjali     Mumbai     95
4    Ravi    Chennai     88
5   Meena  Hyderabad     92
6    Aman       Pune     85
7   Sneha    Kolkata     93
8     Raj  Ahmedabad     90
9   Divya     Jaipur     97

In [30]:
friendsRead.describe()

           marks
count   10.00000
mean    93.70000
std      4.98999
min     85.00000
25%     90.50000
50%     94.00000
75%     97.75000
max    100.00000

In [34]:
# matrix - [row][column]
# df - [col][row]
friendsRead['name']

0     Nitin
1     Shyam
2     Pavan
3    Anjali
4      Ravi
5     Meena
6      Aman
7     Sneha
8       Raj
9     Divya
Name: name, dtype: object

In [35]:
# specific values
friendsRead['name'][2]

'Pavan'

In [36]:
# specific values update
friendsRead['name'][2] = 'PAVAN'

/var/folders/yv/_ddlvjkn6k11_jp7sl8jcy500000gn/T/ipykernel_54477/3709794507.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  friendsRead['name'][2] = 'PAVAN'

In [37]:
friendsRead

     name       city  marks
0   Nitin  Bangalore     98
1   Shyam      Delhi     99
2   PAVAN   Vishakha    100
3  Anjali     Mumbai     95
4    Ravi    Chennai     88
5   Meena  Hyderabad     92
6    Aman       Pune     85
7   Sneha    Kolkata     93
8     Raj  Ahmedabad     90
9   Divya     Jaipur     97

In [39]:
friendsRead.to_csv('friends-read.csv')

In [40]:
friendsRead.index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j',]

In [41]:
friendsRead

     name       city  marks
a   Nitin  Bangalore     98
b   Shyam      Delhi     99
c   PAVAN   Vishakha    100
d  Anjali     Mumbai     95
e    Ravi    Chennai     88
f   Meena  Hyderabad     92
g    Aman       Pune     85
h   Sneha    Kolkata     93
i     Raj  Ahmedabad     90
j   Divya     Jaipur     97

In [42]:
sr = pd.Series([1,2,3,4,5])

In [43]:
sr

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [44]:
type(sr)

pandas.core.series.Series

In [45]:
type(friendsRead)

pandas.core.frame.DataFrame

In [48]:
sr1 = pd.Series(np.random.randint(1, 11, size=10))

In [49]:
sr1

0     2
1     5
2     5
3     2
4     8
5     1
6    10
7     2
8     3
9     2
dtype: int64

In [53]:
randomDf = pd.DataFrame(np.random.randint(1, 101, size=(5,5)), index=np.arange(5))

In [54]:
randomDf

    0   1   2   3   4
0  61  95  34  81  50
1  40  34  57  98  88
2  32  73  72  49   7
3  44  71  44  39  62
4  58  64  55  46  61

In [55]:
randomDf.describe()

               0          1          2          3         4
count   5.000000   5.000000   5.000000   5.000000   5.00000
mean   47.000000  67.400000  52.400000  62.600000  53.60000
std    12.247449  21.984085  14.328294  25.540164  29.55165
min    32.000000  34.000000  34.000000  39.000000   7.00000
25%    40.000000  64.000000  44.000000  46.000000  50.00000
50%    44.000000  71.000000  55.000000  49.000000  61.00000
75%    58.000000  73.000000  57.000000  81.000000  62.00000
max    61.000000  95.000000  72.000000  98.000000  88.00000

In [56]:
randomDf1 = pd.DataFrame(np.random.randint(1, 101, size=(200,5)), index=np.arange(200))

In [57]:
randomDf1

      0   1   2   3   4
0     6  84  17  90  46
1    67  28  98  85  30
2    40  23  35  14  76
3    70  34  94  19  89
4    86   4  20  95  71
..   ..  ..  ..  ..  ..
195  19  96  59  89  51
196  84  58  48   9  55
197  37  47  90  78  73
198  56  10  99  61  53
199  67  47  29  91   7

[200 rows x 5 columns]

In [58]:
randomDf1.head(20)

     0   1   2   3    4
0    6  84  17  90   46
1   67  28  98  85   30
2   40  23  35  14   76
3   70  34  94  19   89
4   86   4  20  95   71
5   79  18  57  91   69
6   87   9  59  99   31
7   85  89  99  35  100
8   16  28  88  62  100
9    8  30  67  25   16
10  24  29  94  95   68
11  63  54  71  62   18
12  55  56  30  27   17
13  88  37  83  75   97
14  20  73  58  34   84
15  87  45  48   1   74
16   9   5  20  72   85
17  88  53  53  82   20
18  33  22  70  73   77
19  84  43  96  15   52

In [59]:
randomDf1.tail(20)

      0   1   2   3   4
180  58  76  38  74  44
181  42  35  75  43  41
182  46  61  91  87  47
183  53  26  11  40  67
184  78  25   7  77  99
185  61  96  80  94  70
186   3  35  47  55  12
187  61  79  39  17  27
188  32  31  97   6  68
189  59  79   9  11  78
190  55  96  30  68  90
191  20  17  25   9  87
192  83  72  88  27  60
193  38  84  14  73  96
194  32  10  44  36   2
195  19  96  59  89  51
196  84  58  48   9  55
197  37  47  90  78  73
198  56  10  99  61  53
199  67  47  29  91   7

In [60]:
randomDf1.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       190, 191, 192, 193, 194, 195, 196, 197, 198, 199],
      dtype='int64', length=200)

In [61]:
randomDf1.columns

RangeIndex(start=0, stop=5, step=1)

In [63]:
randomDf1.to_numpy()

array([[  6,  84,  17,  90,  46],
       [ 67,  28,  98,  85,  30],
       [ 40,  23,  35,  14,  76],
       [ 70,  34,  94,  19,  89],
       [ 86,   4,  20,  95,  71],
       [ 79,  18,  57,  91,  69],
       [ 87,   9,  59,  99,  31],
       [ 85,  89,  99,  35, 100],
       [ 16,  28,  88,  62, 100],
       [  8,  30,  67,  25,  16],
       [ 24,  29,  94,  95,  68],
       [ 63,  54,  71,  62,  18],
       [ 55,  56,  30,  27,  17],
       [ 88,  37,  83,  75,  97],
       [ 20,  73,  58,  34,  84],
       [ 87,  45,  48,   1,  74],
       [  9,   5,  20,  72,  85],
       [ 88,  53,  53,  82,  20],
       [ 33,  22,  70,  73,  77],
       [ 84,  43,  96,  15,  52],
       [  8,  34,  60,  41,  17],
       [ 61,  83,  18,  66,  71],
       [ 40,  80,  93,  63,  25],
       [ 67,  48,  18,   8,  96],
       [ 23,  24,  43,  22,  71],
       [ 47,  67,  31,   8,  17],
       [ 56,  99,   6,  17,  22],
       [ 94,  66,  95,  10,  69],
       [  1,  61,  87,   7,  90],
       [ 98,  47,  90,  54,  50],
       [ 39,  55,  34,  74,  64],
       [  5,  64,  80,  16,  19],
       [ 98,  19,  97,  92,  24],
       [ 95,  71,  14,  98,  37],
       [ 45,  35,  49,  54,  60],
       [ 99,  73,  64,  67,  68],
       [ 42,  79,  62,  74,  11],
       [ 78,  84,  22,  67,  19],
       [ 92,  15,  68,  71,  79],
       [ 12,  50,  85,  16,  90],
       [ 32,  33,  72,   3,  72],
       [ 89,  86,  18,  10,  43],
       [ 56,  86,  64,  72,  66],
       [ 36,  55,  58,  80,  31],
       [ 59,  93,  78,  93,  64],
       [ 80,  84,  67,  84,  29],
       [ 15,  25,   1,  51,  23],
       [ 33,  21,  57,   2,  45],
       [  8,  79,   4,  53,  58],
       [ 30,  75,   6,  90,   7],
       [ 69,  97,  53,  69,  24],
       [ 41,  49,   3,  38,  74],
       [ 52,  48,  63,  73,  49],
       [ 75,  87,   7,  99,  84],
       [  4,  25,  22,  14,  26],
       [ 55,  76,  81,   3,  48],
       [100,  93,  16,  64,  36],
       [ 41,  54,  36,  14,  95],
       [ 66,  79,  17,  45,  81],
       [ 59,  20,  62,  69,  21],
       [ 13,  67,  66,  49,  33],
       [ 75,  41,  87,  10,  12],
       [ 93,  80,  75,  40,  58],
       [ 19,  41,  91,  13,  43],
       [ 92,  29,  41,  90,  77],
       [ 95,  59,  53,  42,  19],
       [  4,  79,  68,  74,   6],
       [ 78,  89,  71,  36,  32],
       [  9,  30,   5,  94,  14],
       [ 34,  45,   6,  50,  60],
       [ 97,  98,  41,  15,  15],
       [ 13,  36,  27,   7,  91],
       [ 38,  26,   4,  81,  96],
       [ 14,  15,  36,  41,  37],
       [ 38,  15,  15,  96,  51],
       [ 72,  39,  95,  71,  53],
       [ 71,  98,  55,  39,  88],
       [ 83,  25,  26,  78,  91],
       [ 13,  43,  46,  76,  62],
       [  7,   5,  52,  11,  69],
       [ 36,  96,  26,  25,  23],
       [ 95,  10,  94,  98,  30],
       [ 27,  27,  42,  52,  84],
       [ 11,  59,  76,  77,  97],
       [ 58,  56,  71,   7,  13],
       [ 80,   5,  82,  15,  78],
       [ 30,  73,  68,  81,   3],
       [ 74,  72,  95,  98,  54],
       [ 42,  20,  59,  62,  34],
       [ 38,  40,  13,  47,  76],
       [ 24,  24,  83,  43,  10],
       [ 62,  11,  23,  33,  63],
       [ 13,  93,  82,   3,  89],
       [ 35,  52,  70,  11,  90],
       [ 63,  16,  68,  68,  85],
       [ 14,  32,  13,  77,  16],
       [ 29,   4,  81,  99,  56],
       [ 93,  72,  49,  44,   7],
       [ 57,  53,  42,  38,  38],
       [ 74,  21,  44,  34,  43],
       [ 87,  83,  77,  66,  53],
       [ 68,  68,  62,  59,  72],
       [ 30,  44,  93,  39,  91],
       [ 89,  61,  54,  11,  55],
       [ 55,  70,  44,  99,  88],
       [ 36,   2,  84,  86,  90],
       [ 90,  32,  53,  50,  78],
       [ 86,  21,  50,  87,  33],
       [ 38,  59,  28,  98,  80],
       [ 27,  49,  65,   1,   3],
       [ 12,  41,  25,  55,  24],
       [ 83,  30, 100,  63,  24],
       [ 60,  52,  82,  73,   4],
       [ 38,  37,  50,  65,  77],
       [ 63,   5,  20,   9,  42],
       [ 55,  18,  38,  46,   8],
       [ 50,  19,  36,  37,  83],
       [ 33,  77,  55,  71,  17],
       [  3,  47,   4,  73,  90],
       [ 20,  98,  52,  64,  52],
       [ 83,  38,  21,   9,   3],
       [ 44,  74,  63,   4,  36],
       [ 22,  49,  88,  41,  22],
       [  3,  30,  50,  76,  42],
       [ 86,  99,  48,  96,  79],
       [ 97,  44,  96,  63,  15],
       [ 42,  22,  25,  20,  19],
       [ 22,  89,  39,  28,  90],
       [ 80,  99,  92,  41,  24],
       [ 60,  32,  32,  52,  38],
       [ 94,  61,   9,  67,  46],
       [ 99,  54,  76,  95,  63],
       [ 34,  42,  35,  28,  50],
       [ 48,  96,  93,  84,  67],
       [ 74,  90,  73,  58,  26],
       [ 85,  48,  27,  13,  84],
       [ 82,  13,  40,  69,  94],
       [ 87,  75,  12,  71,  23],
       [ 20,   9,  37,  42,   2],
       [ 36,  89,  69,  65,  42],
       [ 31,  14,  34,  38,   7],
       [ 69,   1,  36,  30,  66],
       [100,  95,  29, 100,  29],
       [  7,  45,  99,  91,  19],
       [ 17,  57,  69,   3,   4],
       [100,   7,  50,  37,  18],
       [ 69,  90,  79,  41,  67],
       [ 31,  74,  10,  64,  46],
       [ 98,  94,  55,  21,  85],
       [ 73,  98,  42,  34,   1],
       [ 98,  62,  59,  60,  19],
       [  2,  32,   8,  62,  28],
       [  7,  95,  94,  92,   3],
       [ 28,  17,  62,  63,  26],
       [ 89,  28,  94,   6,  89],
       [ 99,  32,  60,  35, 100],
       [ 27,  87,   4,  92,  17],
       [ 31,  86,  95,   3,   3],
       [ 31,  78,  66,  32,   4],
       [ 62,  93,  69,  46,  78],
       [ 67,  83,  34,  83,  12],
       [ 85,  27,   5,  54,  55],
       [ 49,  72,  49,  56, 100],
       [  6,  36,  49,   8,  21],
       [ 83,  46,  76,  93,  39],
       [ 89,  21,  50,  80,  11],
       [  1,  56,  17,  51,  21],
       [  6, 100,  44,  15,  83],
       [ 17,  65,  87,  84,  70],
       [  5,  12,  50,  55,  41],
       [ 46,  49,  26,  69,  63],
       [ 68,  42,  23,  73,  59],
       [ 62,  69,  75,  13,  63],
       [  7,  51,  55,  21,  10],
       [ 92,  14,  27,  27,  23],
       [ 22,  67,  35,  38,  99],
       [ 12,  45,  21,  65,  65],
       [ 44,  15,   8,  36,  10],
       [ 59,   9,  49,  20,  31],
       [ 14,  46,  23,  89,  24],
       [ 58,  76,  38,  74,  44],
       [ 42,  35,  75,  43,  41],
       [ 46,  61,  91,  87,  47],
       [ 53,  26,  11,  40,  67],
       [ 78,  25,   7,  77,  99],
       [ 61,  96,  80,  94,  70],
       [  3,  35,  47,  55,  12],
       [ 61,  79,  39,  17,  27],
       [ 32,  31,  97,   6,  68],
       [ 59,  79,   9,  11,  78],
       [ 55,  96,  30,  68,  90],
       [ 20,  17,  25,   9,  87],
       [ 83,  72,  88,  27,  60],
       [ 38,  84,  14,  73,  96],
       [ 32,  10,  44,  36,   2],
       [ 19,  96,  59,  89,  51],
       [ 84,  58,  48,   9,  55],
       [ 37,  47,  90,  78,  73],
       [ 56,  10,  99,  61,  53],
       [ 67,  47,  29,  91,   7]])

In [66]:
s1 = pd.Series([10,20,30], index=['a', 'b', 'c'])

In [67]:
s1

a    10
b    20
c    30
dtype: int64

In [68]:
s1['a']

10

In [83]:
df1= pd.DataFrame([
    ['Tom', 28],
    ['Jerry', 31]
], columns=['Name', 'Age'])

In [71]:
df1

    Name  Age
0    Tom   28
1  Jerry   31

In [84]:
df1['City'] = ['Delhi', 'Mumbai']

In [73]:
df1

    Name  Age    City
0    Tom   28   Delhi
1  Jerry   31  Mumbai

In [85]:
# axis 
# 0 - row (default)
# 1 - column
df1.drop('Age', axis=1) # view

    Name    City
0    Tom   Delhi
1  Jerry  Mumbai

In [86]:
df1

    Name  Age    City
0    Tom   28   Delhi
1  Jerry   31  Mumbai

In [87]:
df1.drop('Age', axis=1, inplace=True)

In [88]:
df1

    Name    City
0    Tom   Delhi
1  Jerry  Mumbai

In [89]:
df1['FavFood'] = ['Idli', 'Dosa']

In [90]:
df1

    Name    City FavFood
0    Tom   Delhi    Idli
1  Jerry  Mumbai    Dosa

In [91]:
df1[['Name', 'City']]

    Name    City
0    Tom   Delhi
1  Jerry  Mumbai

In [97]:
randomDf1.sort_index(axis = 1, ascending=False)

      4   3   2   1   0
0    46  90  17  84   6
1    30  85  98  28  67
2    76  14  35  23  40
3    89  19  94  34  70
4    71  95  20   4  86
..   ..  ..  ..  ..  ..
195  51  89  59  96  19
196  55   9  48  58  84
197  73  78  90  47  37
198  53  61  99  10  56
199   7  91  29  47  67

[200 rows x 5 columns]

In [98]:
randomDf1.sort_index(axis = 0, ascending=False)

      0   1   2   3   4
199  67  47  29  91   7
198  56  10  99  61  53
197  37  47  90  78  73
196  84  58  48   9  55
195  19  96  59  89  51
..   ..  ..  ..  ..  ..
4    86   4  20  95  71
3    70  34  94  19  89
2    40  23  35  14  76
1    67  28  98  85  30
0     6  84  17  90  46

[200 rows x 5 columns]

In [102]:
df1['Name']

0      Tom
1    Jerry
Name: Name, dtype: object

In [104]:
df1

    Name    City FavFood
0    Tom   Delhi    Idli
1  Jerry  Mumbai    Dosa

In [107]:
df1.columns = ["apple", "ball", "cat"]

In [108]:
df1

   apple    ball   cat
0    Tom   Delhi  Idli
1  Jerry  Mumbai  Dosa

In [109]:
df1.columns = ["Name",	"City",	"FavFood"]

In [110]:
df1

    Name    City FavFood
0    Tom   Delhi    Idli
1  Jerry  Mumbai    Dosa

In [111]:
df1['Name'][0]

'Tom'

In [112]:
# Not a recommended way of updation
df1['Name'][0] = 'Mr Tom'

/var/folders/yv/_ddlvjkn6k11_jp7sl8jcy500000gn/T/ipykernel_54477/619621496.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df1['Name'][0] = 'Mr Tom'

In [113]:
df1['Name'][0]

'Mr Tom'

In [114]:
df1

     Name    City FavFood
0  Mr Tom   Delhi    Idli
1   Jerry  Mumbai    Dosa

In [120]:
# recommended way to update
df1.loc[0, 'Name'] = 'TOM'

In [121]:
df1

    Name    City FavFood
0    TOM   Delhi    Idli
1  Jerry  Mumbai    Dosa

In [122]:
randomDf

    0   1   2   3   4
0  61  95  34  81  50
1  40  34  57  98  88
2  32  73  72  49   7
3  44  71  44  39  62
4  58  64  55  46  61

In [127]:
randomDf.loc[(randomDf[0] < 50) & (randomDf[3] < 50) ]

    0   1   2   3   4
2  32  73  72  49   7
3  44  71  44  39  62

In [128]:
randomDf

    0   1   2   3   4
0  61  95  34  81  50
1  40  34  57  98  88
2  32  73  72  49   7
3  44  71  44  39  62
4  58  64  55  46  61

In [129]:
randomDf.iloc[2,2]

72

In [130]:
df1

    Name    City FavFood
0    TOM   Delhi    Idli
1  Jerry  Mumbai    Dosa

In [133]:
df1.loc[0,'City']

'Delhi'

In [ ]:
df1.loc[0,'City']